Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F16B.tmx
Source language: en_us
Languages: zh_cn

source: Friendship - An Overlapping of Life
zh_cn: 友谊——生活的重叠

source: In this age of social media, the possibilities to reach and connect with people across the world have multiplied in an unprecedented manner.
zh_cn: 在这个社会媒体的时代，与世界各地的人们相互联系在一起的可能性，正以空前的规模增加。

source: Add friends at the click of a button, keep them updated with your latest tweets or quickly build a following on your blog - the networking options are almost limitless.
zh_cn: 点击一个按钮添加朋友，让他们能知道你最新发表的帖子，或者在你的博客上快速建造一个粉丝群——网络里的选择无穷无尽。

source: As the number of our virtual friends and followers multiply, have you ever wondered, how much of it is really "real?"
zh_cn: 当我们的虚拟朋友和追随者的数量成倍增加时，你可曾想过，有多少人是真正“真实的”吗？

source: What does friendship actually mean to you?
zh_cn: 实际上友谊对你来说意味着什么？

source: Today, Sadhguru tells us what friendship means to him.
zh_cn: 今天，Sadhguru告诉我们友谊对他意味着什么。

source: Sadhguru: I made my first friend at the age of three or four, after they sent me to school.
zh_cn: Sadhguru：我交第一个朋友是在三四岁的时候，就在我去学校上学之后。

source: I built such a bond with him, he was more than anything else to me.
zh_cn: 我和这个朋友的关系非常要好，以至于他对我来说比其他任何东西都重要。

source: I still remember his name.
zh_cn: 我现在仍然记得他的名字。

source: I am sure he doesn't.
zh_cn: 但是我相信他不记得我的了。

source: I had a wide variety of friends, hundreds of friends all over the place, but that's different.
zh_cn: 我有各种各样的朋友，到处都有数以百计的朋友，但那是不同的。

source: I am talking about the bond that I built with real friends - I always thought it was absolute.
zh_cn: 我讲的是我与生活中真实的朋友之间的关系——我总是认为这是纯粹的。

source: But over a period of time, with the experience of life, I realized there are very few people who see friendship like that.
zh_cn: 但是一段时间以后，随着生活阅历的增加，我发现很少有人会这样看待友谊。

source: Most people see friendship as context-oriented.
zh_cn: 大多数人认为友谊是与环境相关的。

source: When you are in school, you have one kind of friend.
zh_cn: 当你在学校的时候，你有学样的朋友。

source: When school is over, you just drop them and pick college friends.
zh_cn: 当中学毕业的时候，你就扔掉他们然后去交大学的朋友。

source: When college is over, professional friends, and whatever else.
zh_cn: 大学毕业后，就去和专业上的朋友来往，或者其他等等。

source: That's how people look at friendship.
zh_cn: 这就是人们如何看待友谊的。

source: I've not been able to look at it like that.
zh_cn: 我没办法这样看。

source: I am not disgruntled, but it has been a learning experience about human nature.
zh_cn: 并不是我不高兴，只是友谊是一种人性的学习经验。

source: My need for friendship was never too much but the moment I formed a friendship, I always thought it was for good and in every way absolute.
zh_cn: 我对友谊的需求从来不多，但是从我形成一段友谊的那一刻起，我总是认为它是善意的，而且在各个方面都是纯粹的。

source: I've found good friends here and there, but even for them, as life situations change, their needs and their focus on the friendship changes.
zh_cn: 我在各个地方交了许多好朋友，但即使是对他们来说，随着生活的变化，他们的对友谊的需求和关注也发生了变化。

source: For me it never changes.
zh_cn: 而对我来说，友谊永远不会改变。

source: I wouldn't say it is heartbreaking, but definitely it is disappointing that most people cannot form deep relationships in their lives.
zh_cn: 我不会说这令人痛心，但大多数人不能在生活中形成深厚的友谊绝对是件令人失望的事儿。

source: They can form relationships only according to their needs; they cannot form relationships beyond their needs.
zh_cn: 他们只是根据他们的需求建立关系，而不能建立超出他们需求以外的关系。

source: A relationship just for the sake of relationship, that is not there in most people.
zh_cn: 关系只是为了关系，对于大部分人来说关系并不持续存在。

source: They form a relationship when they need it; when they don't need it, they break it.
zh_cn: 他们在需要的时候形成一个关系，而不需要时，就断绝关系。

source: For me, friendship is not an advantageous transaction or give-and-take, for me friendship is a certain overlapping of life.
zh_cn: 对我来说，友谊不是一个有利的交易或平等交换，对我来说友谊是生活的特定重叠。

source: I am a little bit of a fool in such matters.
zh_cn: 我在这样的问题上还是有点傻。

source: Even now if I meet an old school friend, I still approach him the way I knew him at that time.
zh_cn: 即使是现在，如果我遇到一个老同学，我仍会用以前熟知的方式对待他。

source: But he is somewhere else, no longer the way he was.
zh_cn: 但他已经不再是原来的那个人了。

source: Probably they move on with life and I don't. I have always stayed a little outside of it.
zh_cn: 可能他们已经随着生活前行，而我还停留在原地。我总是略微地置身于生活之外。

source: I valued life that way, so I always kept it that way.
zh_cn: 我以这种方式珍惜着我的生活，所以我总是保持这种方式。

source: I think it continues to be so even today.
zh_cn: 即便在今天仍是如此。

source: I think life has been phenomenally generous with me.
zh_cn: 我认为生活是非常慷慨的。

source: When I say generous, I am not talking about material things but the way life treats me wherever I go, the way it opens up for me without any effort.
zh_cn: 我说的慷慨，指的不是物质的东西，而是无论我走到哪里，生活对待我的方式，不费吹灰之力便呈现在我眼前。

source: The life process is willing to open up all its secrets to me probably because of the bonding that I form with whatever I sit with.
zh_cn: 生活的过程愿意向我展示所有的秘密，可能是因为我和任何身边的东西形成的联系。

source: Even if I am in touch with a simple inanimate thing, I form a certain relationship with it.
zh_cn: 即便我与一个简单的无生命的东西建立了联系，我也会与它形成一定形式的关系。

source: For example if I look at what Mysore means to me, I have a very deep bonding with that place simply because I spent a large part of my growing-up period there.
zh_cn: 比如说迈索尔对我的意义吧，我对那个地方有很深的联系，因为我大部分的成长时期都是在那里度过的。

source: I am not looking at it emotionally or sentimentally as people normally would.
zh_cn: 我不会像人们通常所做的那样激动地或者多情地看待它。

source: It is just the level of involvement I had with the land, the trees, the hills, with everything around.
zh_cn: 而仅仅只是我对土地、树木、山上，以及周围的一切的热爱的程度。

source: Lots of things have changed in the last 30 years, but still I can see so many places that I walked upon, how deeply I looked at things, and the billion questions that I asked at a billion different places in Mysore.
zh_cn: 在过去的30年里很多事情已经改变了，但我仍然可以看到我走过的很多地方，我观察东西是多么深入，我在迈索尔的数亿个不同的地方问过的数亿的问题。

source: It forms a very different kind of bond which brought me to a certain level of quest within myself.
zh_cn: 这形成了一种非常特殊的联系，而这些联系则满足了我某种程度上的自我需求。

source: For me, Mysore means a billion questions and at the same time an incredible answer too.
zh_cn: 对我来说，迈索尔意味着十亿个问题，同时，它也是一个不可思议的答案。

source: Friendships also meant the same thing for me.
zh_cn: 友谊对我来说也是这样。

source: Those few moments that I shared with someone, not necessarily just in terms of emotion - I was really not emotional about anyone in that sense - but somehow knowingly or unknowingly, moments of sharing were moments of uniting and becoming one in some way.
zh_cn: 我与别人分享的这几分钟，未必只是情绪上的（我在这个意义上真的对任何人都没有感情）而是有意或无意地，分享的时刻在某种程度上就是把大家都联结成一个整体的时刻。

source: I never saw sharing as giving and taking; I always saw sharing as two lives overlapping each other.
zh_cn: 我从不认为分享是平等交换，我觉得它是两种生活的互相重叠。

source: I did not see friendship as an advantageous or useful thing, something that will help you live better or whatever else.
zh_cn: 我觉得友谊不是一种可以帮助你生活更好或做其他事情的有利或有用的东西。

source: Even now when I travel around the world and meet all kinds of people, I don't network with them, I don't keep their phone numbers, I don't try to contact them, but I share something very deep with them in those few moments of being together and many of them do share that with me too.
zh_cn: 即使现在当我环游世界，遇见各种各样的人，我不与他们建立关系网，也没要他们的电话号码，更没有想要联系他们，但我在和他们一起这些短暂的时间里与他们深入地分享，他们也是这样。

source: But my sense of that sharing is a permanent process while I see that for most people, it is a passing process.
zh_cn: 我觉得分享是一个永恒的过程，但是我发现对大多数人来说，它只是一时的过程。

source: Probably my idea of friendship is too old-fashioned, or I don't know if it was ever in fashion.
zh_cn: 可能我对友谊的想法太过时了，或者我不知道它是不是时尚。

source: Maybe it is a little silly, maybe it is not socially savvy, but in terms of life, I think my ability to bond with anything or anyone deeply - whether it is a tree, a place that I sat upon, a piece of land, a rock or people - has in many ways been the key which has opened up dimensions of life and nature to me.
zh_cn: 也许它是有点傻，也许它在社会上并不能被理解，但就生活而言，我认为我与任何东西或任何人深入建立联系的能力——不论是一棵树，我坐的一个地方，一块土地，一块石头或者坐在一起的人——在很多方面是我发现生命和自然本质的关键。

source: So, for me, friendship is not an advantageous transaction or give-and-take, for me friendship is a certain overlapping of life.
zh_cn: 所以，对我来说，友谊不是一个有利的交易或平等交换，对我来说友谊是生活的特定重叠。
